# GetLength Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..GetLength Method
XYZ Class See Also
---
Gets the length of this vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetLength()
```

Visual Basic
---
```text
Public Function GetLength As Double
```

Visual C++
---
```text
public:
double GetLength()
```

# Remarks
In 3-D Euclidean space, the length of the vector is the square root of the sum of the three coordinates squared.
# See Also
XYZ Class
Autodesk.Revit.DB Namespace